app/views/students/_student.html.erb

                  <div class="panel-body"><!-- Panel Body -->
                    <div style="color: #3BB2D6;"><%= time_ago_in_words(student.created_at) %></div>
---
INSERT INTO "students" ("name", "gender", "address", "birthday", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Jan Vincent Panes"], ["gender", "Male"], ["address", ""], ["birthday", "2017-03-21"], ["created_at", "2017-03-21 18:24:53.915637"], ["updated_at", "2017-03-21 18:24:53.915637"]]