app/controllers/parents_controller.rb

  def index
    @parents = Parent.all
---
SELECT "parents".* FROM "parents"

  def create
    @parent = Parent.new(parent_params)

    respond_to do |format|
      if @parent.save
---
INSERT INTO "parents" ("name", "address", "email", "phone_number", "child", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @parent.update(parent_params)
---
UPDATE "parents" SET "email" = ?, "phone_number" = ?, "child" = ?, "updated_at" = ? WHERE "parents"."id" = ?  [["email", "kerthugot@gbox.adnu.edu.ph"], ["phone_number", "8700"], ["child", "Kerty Mae Tapel"], ["updated_at", "2017-03-06 01:16:52.189197"], ["id", 3]]

    def set_parent
      @parent = Parent.find(params[:id])
---
SELECT  "parents".* FROM "parents" WHERE "parents"."id" = ? LIMIT 1  [["id", 1]]