app/controllers/students_controller.rb

SELECT "students".* FROM "students" WHERE (name LIKE '%Jan Vincent B. Panes%')
---
  def index

    @students = Student.all

INSERT INTO "students" ("name", "gender", "address", "birthday", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Jan Vincent Panes"], ["gender", "Male"], ["address", ""], ["birthday", "2017-03-21"], ["created_at", "2017-03-21 18:24:53.915637"], ["updated_at", "2017-03-21 18:24:53.915637"]]
---
  def create
    @student = Student.new(student_params)

    respond_to do |format|
      if @student.save