app/controllers/subjects_controller.rb

INSERT INTO "subjects" ("subject_name", "first_grading", "second_grading", "third_grading", "fourth_grading", "Final_grade", "student_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @subject = Subject.new(subject_params)

    respond_to do |format|
      if @subject.save

DELETE FROM "subjects" WHERE "subjects"."id" = ?  [["id", 1]]
---
  def destroy
    @subject.destroy